app/Controllers/Auth.php

    public function loginProcess()
    {
        $session = session();
        $model = new UserModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $data = $model->where('username', $username)->first();
---
SELECT *
FROM `tbl_user`
WHERE `username` = 'Cyber Security People'
 LIMIT 1