app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `tbl_mahasiswa`
SELECT COUNT(*) AS `numrows` FROM `tbl_matakuliah`
SELECT *
FROM `tbl_mahasiswa`
ORDER BY `id` DESC
 LIMIT 5
SELECT *
FROM `tbl_matakuliah`
 LIMIT 5
---
    public function index()
    {
        $mhsModel = new MahasiswaModel();
        $mkModel = new MatakuliahModel();

        $data = [
            'title' => 'Dashboard',
            'jumlah_mhs' => $mhsModel->countAll(),
            'jumlah_mk'  => $mkModel->countAll(),
            'mahasiswa_terbaru' => $mhsModel->orderBy('id', 'DESC')->findAll(5),
            'data_matakuliah'   => $mkModel->findAll(5)